In [2]:
import pandas as pd

In [9]:
df = pd.read_csv("changed.csv")
print(df)
df.columns

    Unnamed: 0  id          name   age country   gender    income
0            0   1      John Doe  29.0     USA     Male   55000.0
1            1   1      John Doe  29.0     USA     Male   55000.0
2            2   2    Jane Smith   0.0  Canada   Female   62000.0
3            3   3          Alex   0.0     USA  Unknown   47000.0
4            4   4  Maria Garcia  34.0   Spain   Female       0.0
5            5   5        Li Wei  27.0   China     Male   51000.0
6            6   6             0  45.0   India   Female  730000.0
7            7   7    Ahmed Khan  38.0       0     Male   68000.0
8            8   8    Rachel Lee  29.0     USA   Female   62000.0
9            9   9   Carols Ruiz   0.0  Mexico     Male   45000.0
10          10  10   Emily Davis  31.0     USA   Female   58000.0

Index(['Unnamed: 0', 'id', 'name', 'age', 'country', 'gender', 'income'], dtype='object')

In [10]:
df.groupby("country")["income"].max()

country
0          68000.0
Canada     62000.0
China      51000.0
India     730000.0
Mexico     45000.0
Spain          0.0
USA        62000.0
Name: income, dtype: float64

In [11]:
df.groupby("country")["income"].min()

country
0          68000.0
Canada     62000.0
China      51000.0
India     730000.0
Mexico     45000.0
Spain          0.0
USA        47000.0
Name: income, dtype: float64

In [12]:
df.groupby("country")["income"].mean()

country
0          68000.0
Canada     62000.0
China      51000.0
India     730000.0
Mexico     45000.0
Spain          0.0
USA        55400.0
Name: income, dtype: float64

In [13]:
df.groupby("gender")["income"].mean()

gender
Female     182400.0
Male        54800.0
Unknown     47000.0
Name: income, dtype: float64

In [20]:
#Aggregation

df.groupby("country")["income"].agg(["mean", "min", "max"])
df.groupby("country")["income"].aggregate(["mean", "min", "max"])


#We can rename the column names to display
df.groupby("country")["income"].agg(avg_salary="mean", min_salary="min", max_salary="max")

         avg_salary  min_salary  max_salary
country
0           68000.0     68000.0     68000.0
Canada      62000.0     62000.0     62000.0
China       51000.0     51000.0     51000.0
India      730000.0    730000.0    730000.0
Mexico      45000.0     45000.0     45000.0
Spain           0.0         0.0         0.0
USA         55400.0     47000.0     62000.0

In [ ]:
#Group by Coutry and apply aggregate functions on different columns
df.groupby("country").agg({
    "income":"mean",
    "age":"mean"
})

df.groupby("country").agg({
    "income":"max",
    "age":"mean"
})

#Whn aggregate funcions are applied, it is better to rename the column so that they make better sense
df.groupby("country").agg(
    max_salary=("income","max"),
    avg_age=("age","mean")
)

         max_salary  avg_age
country
0           68000.0     38.0
Canada      62000.0      0.0
China       51000.0     27.0
India      730000.0     45.0
Mexico      45000.0      0.0
Spain           0.0     34.0
USA         62000.0     23.6